app/Controllers/Admin.php

SELECT `users`.`id` as `userid`, `username`, `email`, `name`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
---
    public function muser()
    {
        $data ['title'] = 'User list';

        $this->builder->select('users.id as userid, username, email, name, created_at');
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
        $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');
        $query = $this->builder->get();