app/Controllers/Admin.php

    public function musers()
    {
        $users = new \MyAuth\Auth\Models\UserModel();
        $data['users'] = $users->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL