app/Controllers/Kategori.php

    public function index()
    {
        $noHalaman = $this->request->getVar('page_kategori') ? $this->request->getVar('page_kategori') : 1;
        $data = [
            'datakategori' => $this->kategori->paginate(2, 'kategori'),
            'pager' => $this->kategori->pager,
            'nohalaman' => $noHalaman
        ];
---
SELECT *
FROM `kategori`
 LIMIT 2, 2
SELECT COUNT(*) AS `numrows`
FROM `kategori`