app/Controllers/Penjualan.php

SELECT *
FROM `produk`
WHERE `kodebarcode` LIKE '%3413412353252153234%' ESCAPE '!'
OR  `namaproduk` LIKE '%3413412353252153234%' ESCAPE '!'
---
    public function simpanTemp()
    {
        if ($this->request->isAJAX()) {
            $kodebarcode = $this->request->getPost('kodebarcode');
            $namaproduk = $this->request->getPost('namaproduk');
            $jumlah = $this->request->getPost('jumlah');
            $nofaktur = $this->request->getPost('nofaktur');

            if (strlen($namaproduk) > 0) {
                $queryCekProduk = $this->db->table('produk')->where('kodebarcode', $kodebarcode)->where('namaproduk', $namaproduk)->get();

INSERT INTO `temp_penjualan` (`detjual_faktur`, `detjual_kodebarcode`, `detjual_hargabeli`, `detjual_hargajual`, `detjual_jml`, `detjual_subtotal`) VALUES ('J0101700001', '3413412353252153234', '0.00', '0.00', '1', 0)
---
                        'detjual_subtotal' => floatval($rowProduk['harga_jual']) * $jumlah
                    ];

                    $tblTempPenjualan->insert($insertData);

SELECT SUM(detjual_subtotal) as totalbayar
FROM `temp_penjualan`
WHERE `detjual_faktur` = 'J01017000010648'
---
    public function hitungTotalBayar()
    {
        if ($this->request->isAJAX()) {
            $nofaktur = $this->request->getPost('nofaktur');

            $tblTempPenjualan = $this->db->table('temp_penjualan');

            $queryTotal =  $tblTempPenjualan->select('SUM(detjual_subtotal) as totalbayar')->where('detjual_faktur', $nofaktur)->get();

DELETE FROM `temp_penjualan`
WHERE `detjual_id` = '66'
---
    public function hapusItem()
    {
        if ($this->request->isAJAX()) {
            $id = $this->request->getPost('id');
            $tblTempPenjualan = $this->db->table('temp_penjualan');
            $queryHapus = $tblTempPenjualan->delete(['detjual_id' => $id]);

SELECT *
FROM `temp_penjualan`
WHERE `detjual_faktur` = 'J0101700001'
---
    public function pembayaran()
    {
        if ($this->request->isAJAX()) {
            $nofaktur = $this->request->getPost('nofaktur');
            $tglfaktur = $this->request->getPost('tglfaktur');
            $kopel = $this->request->getPost('kopel');

            $tblTempPenjualan = $this->db->table('temp_penjualan');
            $cekDataTempPenjualan = $tblTempPenjualan->getWhere(['detjual_faktur' => $nofaktur]);