app/Controllers/Produk.php

    public function index()
    {
        $tombolCari = $this->request->getPost('tombolcariproduk');

        if (isset($tombolCari)) {
            $cari = $this->request->getPost('cariproduk');
            session()->set('cariproduk', $cari);
            redirect()->to('/produk/index');
        } else {
            $cari = session()->get('cariproduk');
        }

        $dataProduk = $cari ? $this->produk->cariData($cari) : $this->produk->join('kategori', 'katid=produk_katid')->join('satuan', 'satid=produk_satid');

        $noHalaman = $this->request->getVar('page_produk') ? $this->request->getVar('page_produk') : 1;
        $data = [
            'dataproduk' => $dataProduk->paginate(5, 'produk'),
            'pager' => $this->produk->pager,
            'nohalaman' => $noHalaman
        ];
---
SELECT *
FROM `produk`
JOIN `kategori` ON `katid`=`produk_katid`
JOIN `satuan` ON `satid`=`produk_satid`
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `produk`
JOIN `kategori` ON `katid`=`produk_katid`
JOIN `satuan` ON `satid`=`produk_satid`

    public function ambilDataKategori()
    {
        if ($this->request->isAJAX()) {
            $datakategori = $this->kategori->findAll();
---
SELECT *
FROM `kategori`

    public function ambilDataSatuan()
    {
        if ($this->request->isAJAX()) {
            $datasatuan = $this->satuan->findAll();
---
SELECT *
FROM `satuan`

    public function edit($kode)
    {
        $row = $this->produk->find($kode);

        if ($row) {
            $data = [
                'kode' => $row['kodebarcode'],
                'nama' => $row['namaproduk'],
                'stok' => $row['stok_tersedia'],
                'produkkategori' => $row['produk_katid'],
                'datakategori' => $this->kategori->findAll(),
                'produksatuan' => $row['produk_satid'],
                'datasatuan' => $this->satuan->findAll(),
                'hargabeli' => $row['harga_beli'],
                'hargajual' => $row['harga_jual'],
                'gambarproduk' => $row['gambar']

            ];
---
SELECT *
FROM `produk`
WHERE `produk`.`kodebarcode` = 't3453453'
SELECT *
FROM `kategori`
SELECT *
FROM `satuan`