app/Controllers/Satuan.php

    function hapus()
    {
        if ($this->request->isAJAX()) {
            $idSatuan = $this->request->getVar('idsatuan');

            $this->satuan->delete($idSatuan);
---
DELETE FROM `satuan`
WHERE `satid` IN ('17')