app/Models/Modeldataproduk.php

    public function count_all()
    {
        $tbl_storage = $this->db->table($this->table)->join('kategori', 'katid=produk_katid');
        return $tbl_storage->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `produk`
JOIN `kategori` ON `katid`=`produk_katid`